Config/Documents/ИзменениеДанныхОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ИзменениеДанныхОС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УчетныеДанныеОбъектаОС</xr:Item>
				<xr:Item>InformationRegister.НомераИнвентарныхКарточек</xr:Item>
				<xr:Item>InformationRegister.ПервоначальныеСведенияОСБухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьУчетныеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьИнвентарнаяКарточка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьПервоначальныеСведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзмененияУчетныхДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНовый</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыУчетаНФА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУчетаНовый</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыУчетаНФА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидИмущества</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыИмущества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидИмуществаНовый</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыИмущества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФОНовый</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КБК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КБКНовый</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭКНовый</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерИнвентарнойКарточки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерИнвентарнойКарточкиНовый</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИнвентарнойКарточки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИнвентарнойКарточкиНовая</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимостьНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСуммаАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСуммаАмортизацииНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСуммаОбесценения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСуммаОбесцененияНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимостьВВалюте</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимостьВВалютеНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаПоступления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаПоступленияНовая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНовое</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/УчетныеДанныеОбъектаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УчетныеДанныеОбъектаОС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИмущества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИмущества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КФО</Name>
					<Comment>Только для счетов 101,102,103,108</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПС</Name>
					<Comment>Только для счетов 101,102,103,108.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаНФА</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ПервоначальныеСведенияОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияОСБухгалтерскийУчет</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСуммаАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСуммаОбесценения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимостьВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Documents/ИзменениеДанныхОС/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Ключ.Пустая() Тогда
		ОбновитьТекстовыеПоляВсехСтрок(ЭтотОбъект);
		
		Если НЕ Параметры.ЗначениеКопирования.Пустая() Тогда
			ДатаПриИзмененииНаСервере();
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ИзмененияУчетныхДанныхГруппаПервоначальнаяСтоимостьВВалюте", "Видимость",
		ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, ЭтаФорма.Элементы.ИнформационныеСсылки);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьКолонок();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.ОсновныеСредства.Форма.ФормаВыбора" Тогда
		ОбработкаВыбораПодбораОССервер(ВыбранноеЗначение);
		ОбновитьТекстовыеПоляВсехСтрок(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения	
	
	ОбновитьТекстовыеПоляВсехСтрок(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбновитьТекстовыеПоляВсехСтрок(ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если Объект.ИзмененияУчетныхДанных.Количество() > 0 Тогда
		// изменение даты заполненного документа
		ДатаПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииФлага(Элемент)
	
	УстановитьВидимостьКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИзмененияУчетныхДанных

&НаКлиенте
Процедура ИзмененияУчетныхДанныхПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		ЗаполнитьПоясненияВСтроке(Элемент.ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмененияУчетныхДанныхОсновноеСредствоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ИзмененияУчетныхДанных.ТекущиеДанные;
	
	ТекущиеДанныеОС = ПолучитьТекущиеДанныеОС(ТекущиеДанные.ОсновноеСредство, Объект.Организация, Объект.Дата);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ТекущиеДанныеОС);
	ЗаполнитьНовыеДанныеИзСтарых(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмененияУчетныхДанныхСчетУчетаНовыйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ИзмененияУчетныхДанных.ТекущиеДанные;
	Элементы.ИзмененияУчетныхДанныхСчетУчетаНовый.ПараметрыВыбора = ПолучитьОграниченияСчета(ТекущиеДанные.ОсновноеСредство);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмененияУчетныхДанныхСчетУчетаНовыйОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Данные = ДанныеПоСчету(ВыбранноеЗначение);
	
	ТекущиеДанные = Элементы.ИзмененияУчетныхДанных.ТекущиеДанные;
	ТекущиеДанные.ВидУчетаНовый		= Данные.ВидУчета;
	ТекущиеДанные.ВидИмуществаНовый	= Данные.ВидИмущества;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмененияУчетныхДанныхВалютаПоступленияНоваяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ИзмененияУчетныхДанных.ТекущиеДанные;
	
	ТекущийКурсВалюты = ПолучитьКурсВалюты(ТекущиеДанные.ВалютаПоступленияНовая, Объект.Дата);
	
	ТекущиеДанные.Курс = ТекущийКурсВалюты.Курс;
	ТекущиеДанные.Кратность = ТекущийКурсВалюты.Кратность;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборОС(Команда)
	
	ПроверяемыеПараметры = СтруктураПроверяемыхРеквизитов();
	Отказ = ОбщегоНазначенияБГУКлиентСервер.ПроверитьЗаполнениеРеквизитов(ПроверяемыеПараметры, Объект, Истина);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВидыНФА = Новый Массив;
	ВидыНФА.Добавить(ПредопределенноеЗначение("Перечисление.ВидыНФА.ОС"));
	ВидыНФА.Добавить(ПредопределенноеЗначение("Перечисление.ВидыНФА.НМА"));
	ВидыНФА.Добавить(ПредопределенноеЗначение("Перечисление.ВидыНФА.НПА"));
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Объект.Организация);
	Отбор.Вставить("ВидНФА", ВидыНФА);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("Справочник.ОсновныеСредства.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьМассивОграниченийСчета(ЗначенияРеквизитовОС)
	
	ОграниченияСписокСчетов = Новый Массив;
	
	Если ЗначенияРеквизитовОС.ИмуществоКазны И ПолучитьФункциональнуюОпцию("ВестиУчетИмуществаКазны") Тогда
		Если ЗначенияРеквизитовОС.ВидНФА = Перечисления.ВидыНФА.НМА Тогда
			ОграниченияСписокСчетов.Добавить("108.54");
		ИначеЕсли ЗначенияРеквизитовОС.ВидНФА = Перечисления.ВидыНФА.НПА Тогда
			ОграниченияСписокСчетов.Добавить("108.55");
		Иначе
			ОграниченияСписокСчетов.Добавить("108.51");
			ОграниченияСписокСчетов.Добавить("108.52");
		КонецЕсли;
	Иначе
		Если ЗначенияРеквизитовОС.ВидНФА = Перечисления.ВидыНФА.НМА Тогда
			ОграниченияСписокСчетов.Добавить("102.00");
		ИначеЕсли ЗначенияРеквизитовОС.ВидНФА = Перечисления.ВидыНФА.НПА Тогда
			ОграниченияСписокСчетов.Добавить("103.00");
		ИначеЕсли ЗначенияРеквизитовОС.ВидНФА = Перечисления.ВидыНФА.КапВложения Тогда
			ОграниченияСписокСчетов.Добавить("106.00");
		Иначе
			ОграниченияСписокСчетов.Добавить("101.00");
			ОграниченияСписокСчетов.Добавить("106.00");
			ОграниченияСписокСчетов.Добавить("107.00");
			ОграниченияСписокСчетов.Добавить("01");
			ОграниченияСписокСчетов.Добавить("02");
		КонецЕсли;
	КонецЕсли;
	
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("ОграниченияСписокСчетов", Новый ФиксированныйМассив(ОграниченияСписокСчетов)));
	
	Возврат МассивПараметровВыбора;
	
КонецФункции

&НаСервере
Функция ПолучитьОграниченияСчета(ОсновноеСредство)
	ЗначенияРеквизитовОС = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОсновноеСредство,"ВидНФА,ИмуществоКазны");
	Возврат Новый ФиксированныйМассив(ПолучитьМассивОграниченийСчета(ЗначенияРеквизитовОС));
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущиеДанныеОС(ОсновноеСредство, Организация, Дата)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОсновноеСредство", ОсновноеСредство);
	Запрос.УстановитьПараметр("Организация"		, Организация);
	Запрос.УстановитьПараметр("Период"			, Новый Граница(Дата, ВидГраницы.Исключая));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеДанныеОбъектаОССрезПоследних.СчетУчета КАК СчетУчета,
	|	УчетныеДанныеОбъектаОССрезПоследних.ВидУчета КАК ВидУчета,
	|	УчетныеДанныеОбъектаОССрезПоследних.ВидИмущества КАК ВидИмущества,
	|	УчетныеДанныеОбъектаОССрезПоследних.КФО КАК КФО,
	|	УчетныеДанныеОбъектаОССрезПоследних.КПС КАК КПС,
	|	УчетныеДанныеОбъектаОССрезПоследних.КЭК КАК КЭК,
	|	УчетныеДанныеОбъектаОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ УчетныеДанныеОбъектаОС
	|ИЗ
	|	РегистрСведений.УчетныеДанныеОбъектаОС.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство В (&ОсновноеСредство)) КАК УчетныеДанныеОбъектаОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ПервоначальнаяСуммаАмортизации КАК ПервоначальнаяСуммаАмортизации,
	|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ПервоначальнаяСуммаОбесценения КАК ПервоначальнаяСуммаОбесценения,
	|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ПервоначальнаяСтоимостьВВалюте КАК ПервоначальнаяСтоимостьВВалюте,
	|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ВалютаПоступления КАК ВалютаПоступления,
	|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.Количество КАК Количество,
	|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ ПервоначальныеСведенияОСБухгалтерскийУчет
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство В (&ОсновноеСредство)) КАК ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомераИнвентарныхКарточекСрезПоследних.НомерИнвентарнойКарточки КАК НомерИнвентарнойКарточки,
	|	НомераИнвентарныхКарточекСрезПоследних.ДатаИнвентарнойКарточки КАК ДатаИнвентарнойКарточки,
	|	НомераИнвентарныхКарточекСрезПоследних.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ НомераИнвентарныхКарточек
	|ИЗ
	|	РегистрСведений.НомераИнвентарныхКарточек.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство В (&ОсновноеСредство)) КАК НомераИнвентарныхКарточекСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность,
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта
	|ПОМЕСТИТЬ КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(
	|			&Период,
	|			Валюта В
	|				(ВЫБРАТЬ
	|					ВТ.ВалютаПоступления
	|				ИЗ
	|					ПервоначальныеСведенияОСБухгалтерскийУчет КАК ВТ)) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетныеДанныеОбъектаОС.СчетУчета КАК СчетУчета,
	|	УчетныеДанныеОбъектаОС.ВидУчета КАК ВидУчета,
	|	УчетныеДанныеОбъектаОС.ВидИмущества КАК ВидИмущества,
	|	УчетныеДанныеОбъектаОС.КФО КАК КФО,
	|	УчетныеДанныеОбъектаОС.КПС КАК КБК,
	|	УчетныеДанныеОбъектаОС.КЭК КАК КЭК,
	|	НомераИнвентарныхКарточек.НомерИнвентарнойКарточки КАК НомерИнвентарнойКарточки,
	|	НомераИнвентарныхКарточек.ДатаИнвентарнойКарточки КАК ДатаИнвентарнойКарточки,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.ПервоначальнаяСуммаАмортизации КАК ПервоначальнаяСуммаАмортизации,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.ПервоначальнаяСуммаОбесценения КАК ПервоначальнаяСуммаОбесценения,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.ПервоначальнаяСтоимостьВВалюте КАК ПервоначальнаяСтоимостьВВалюте,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.Количество КАК Количество,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.ВалютаПоступления КАК ВалютаПоступления,
	|	КурсыВалют.Курс КАК Курс,
	|	КурсыВалют.Кратность КАК Кратность,
	|	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство
	|ИЗ
	|	(ВЫБРАТЬ
	|		УчетныеДанныеОбъектаОС.ОсновноеСредство КАК ОсновноеСредство
	|	ИЗ
	|		УчетныеДанныеОбъектаОС КАК УчетныеДанныеОбъектаОС
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПервоначальныеСведенияОСБухгалтерскийУчет.ОсновноеСредство
	|	ИЗ
	|		ПервоначальныеСведенияОСБухгалтерскийУчет КАК ПервоначальныеСведенияОСБухгалтерскийУчет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НомераИнвентарныхКарточек.ОсновноеСредство
	|	ИЗ
	|		НомераИнвентарныхКарточек КАК НомераИнвентарныхКарточек) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетныеДанныеОбъектаОС КАК УчетныеДанныеОбъектаОС
	|		ПО ВложенныйЗапрос.ОсновноеСредство = УчетныеДанныеОбъектаОС.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ НомераИнвентарныхКарточек КАК НомераИнвентарныхКарточек
	|		ПО ВложенныйЗапрос.ОсновноеСредство = НомераИнвентарныхКарточек.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОСБухгалтерскийУчет КАК ПервоначальныеСведенияОСБухгалтерскийУчет
	|			ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
	|			ПО ПервоначальныеСведенияОСБухгалтерскийУчет.ВалютаПоступления = КурсыВалют.Валюта
	|		ПО ВложенныйЗапрос.ОсновноеСредство = ПервоначальныеСведенияОСБухгалтерскийУчет.ОсновноеСредство";
	
	ДанныеОС = Запрос.Выполнить().Выгрузить();
	
	Если ТипЗнч(ОсновноеСредство) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
		Если ДанныеОС.Количество() > 0 Тогда
			Результат = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеОС[0]);
		Иначе
			Результат = ПустаяСтруктураДанныхОС();
		КонецЕсли;
	Иначе
		Результат = Новый Соответствие;
		Для Каждого ТекСтрока Из ДанныеОС Цикл
			Результат.Вставить(ТекСтрока.ОсновноеСредство, ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТекСтрока));
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Оформление представления номера инвентарной карточки
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ИзмененияУчетныхДанныхНомерИнвентарнойКарточкиНовый");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ИзмененияУчетныхДанных.НомерИнвентарнойКарточкиНовый");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ИзмененияУчетныхДанных.НомерИнвентарнойКарточки");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ИзмененияУчетныхДанных.ОсновноеСредство");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<Исключить>");
	
	
	// Оформление представления даты номера инвентарной карточки
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ИзмененияУчетныхДанныхДатаИнвентарнойКарточкиНовая");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ИзмененияУчетныхДанных.НомерИнвентарнойКарточкиНовый");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "-");
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПоясненияВСтроке(ТекущаяСтрока)
	
	ТекущаяСтрока.НадписьЗначениеДоИзменения	= НСтр("ru = 'до изменения:'");
	ТекущаяСтрока.НадписьЗначениеПослеИзменения	= НСтр("ru = 'после изменения:'");
	
	ТекущаяСтрока.НадписьНомерИнвКарточки		= НСтр("ru = '№:'");
	ТекущаяСтрока.НадписьДатаИнвКарточки		= НСтр("ru = 'от:'");
	
	ТекущаяСтрока.КурсНадпись					= НСтр("ru = 'курс:'");
	ТекущаяСтрока.КратностьНадпись				= НСтр("ru = 'кратность:'");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстовыеПоляВсехСтрок(Форма)
	
	Для Каждого ТекущаяСтрока Из Форма.Объект.ИзмененияУчетныхДанных Цикл
		ЗаполнитьПоясненияВСтроке(ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКурсВалюты(Валюта, Дата) 
	
	Возврат РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, Дата);
	
КонецФункции

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитов()
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация"	, "Организация");
	СтруктураРеквизитов.Вставить("Дата"			, "Дата");
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаСервере
Процедура ОбработкаВыбораПодбораОССервер(СписокОС)
	
	ДанныеОС = ПолучитьТекущиеДанныеОС(СписокОС, Объект.Организация, Объект.Дата);
	
	Для Каждого ОсновноеСредство Из СписокОС Цикл
		ЭлементКоллекции = Объект.ИзмененияУчетныхДанных.Добавить();
		ЭлементКоллекции.ОсновноеСредство = ОсновноеСредство;
		ДанныеТекОС = ДанныеОС[ОсновноеСредство];
		Если ДанныеТекОС <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ЭлементКоллекции, ДанныеТекОС);
		КонецЕсли;
		ЗаполнитьНовыеДанныеИзСтарых(ЭлементКоллекции);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ПустыеДанныеОС = ПустаяСтруктураДанныхОС();
	ОбъектыОС = Объект.ИзмененияУчетныхДанных.Выгрузить(,"ОсновноеСредство").ВыгрузитьКолонку("ОсновноеСредство");
	ДанныеОС = ПолучитьТекущиеДанныеОС(ОбъектыОС, Объект.Организация, Объект.Дата);
	
	Для Каждого ТекущаяСтрока Из Объект.ИзмененияУчетныхДанных Цикл
		
		ТекущиеДанныеОС = ДанныеОС.Получить(ТекущаяСтрока.ОсновноеСредство);
		
		Если ТекущиеДанныеОС = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ПустыеДанныеОС);
		Иначе
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ТекущиеДанныеОС);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПустаяСтруктураДанныхОС()
	
	Возврат Новый Структура("СчетУчета,ВидУчета,ВидИмущества,КФО,КБК,НомерИнвентарнойКарточки,ДатаИнвентарнойКарточки,
		|ПервоначальнаяСтоимость,ПервоначальнаяСуммаАмортизации,ПервоначальнаяСуммаОбесценения,ПервоначальнаяСтоимостьВВалюте,Количество,ВалютаПоступления");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьНовыеДанныеИзСтарых(ТекущаяСтрока)
	
	ТекущаяСтрока.СчетУчетаНовый                      = ТекущаяСтрока.СчетУчета;
	ТекущаяСтрока.ВидУчетаНовый                       = ТекущаяСтрока.ВидУчета;
	ТекущаяСтрока.ВидИмуществаНовый                   = ТекущаяСтрока.ВидИмущества;
	ТекущаяСтрока.КФОНовый                            = ТекущаяСтрока.КФО;
	ТекущаяСтрока.КБКНовый                            = ТекущаяСтрока.КБК;
	ТекущаяСтрока.КЭКНовый                            = ТекущаяСтрока.КЭК;
	ТекущаяСтрока.НомерИнвентарнойКарточкиНовый       = ТекущаяСтрока.НомерИнвентарнойКарточки;
	ТекущаяСтрока.ДатаИнвентарнойКарточкиНовая        = ТекущаяСтрока.ДатаИнвентарнойКарточки;
	ТекущаяСтрока.ПервоначальнаяСтоимостьНовая        = ТекущаяСтрока.ПервоначальнаяСтоимость;
	ТекущаяСтрока.ПервоначальнаяСуммаАмортизацииНовая = ТекущаяСтрока.ПервоначальнаяСуммаАмортизации;
	ТекущаяСтрока.ПервоначальнаяСуммаОбесцененияНовая = ТекущаяСтрока.ПервоначальнаяСуммаОбесценения;
	ТекущаяСтрока.ПервоначальнаяСтоимостьВВалютеНовая = ТекущаяСтрока.ПервоначальнаяСтоимостьВВалюте;
	ТекущаяСтрока.ВалютаПоступленияНовая              = ТекущаяСтрока.ВалютаПоступления;
	ТекущаяСтрока.КоличествоНовое                     = ТекущаяСтрока.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонок()
	
	ВсеКолонки = Не Объект.ИзменитьУчетныеДанные
		И Не Объект.ИзменитьИнвентарнаяКарточка
		И Не Объект.ИзменитьПервоначальныеСведения;
	
	Элементы.ИзмененияУчетныхДанныхГруппаСчетУчета.Видимость						= ВсеКолонки Или Объект.ИзменитьУчетныеДанные;
	Элементы.ИзмененияУчетныхДанныхГруппаВидУчета.Видимость							= ВсеКолонки Или Объект.ИзменитьУчетныеДанные;
	Элементы.ИзмененияУчетныхДанныхГруппаВидИмущества.Видимость						= ВсеКолонки Или Объект.ИзменитьУчетныеДанные;
	Элементы.ИзмененияУчетныхДанныхГруппаКФО.Видимость								= ВсеКолонки Или Объект.ИзменитьУчетныеДанные;
	Элементы.ИзмененияУчетныхДанныхГруппаКПС.Видимость								= ВсеКолонки Или Объект.ИзменитьУчетныеДанные;
	Элементы.ИзмененияУчетныхДанныхГруппаКЭК.Видимость								= ВсеКолонки Или Объект.ИзменитьУчетныеДанные;
	
	Элементы.КолонкиИнвентарнаяКарточка.Видимость 									= ВсеКолонки Или Объект.ИзменитьИнвентарнаяКарточка;
	
	Элементы.ИзмененияУчетныхДанныхГруппаКоличество.Видимость						= ВсеКолонки Или Объект.ИзменитьПервоначальныеСведения;
	Элементы.ИзмененияУчетныхДанныхГруппаПервоначальнаяСтоимость.Видимость			= ВсеКолонки Или Объект.ИзменитьПервоначальныеСведения;
	Элементы.ИзмененияУчетныхДанныхГруппаПервоначальнаяСтоимостьВВалюте.Видимость	= ВсеКолонки Или Объект.ИзменитьПервоначальныеСведения;
	Элементы.ИзмененияУчетныхДанныхГруппаПервоначальнаяАмортизация.Видимость		= ВсеКолонки Или Объект.ИзменитьПервоначальныеСведения;
	Элементы.ИзмененияУчетныхДанныхГруппаПервоначальноеОбесценение.Видимость		= ВсеКолонки Или Объект.ИзменитьПервоначальныеСведения;
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция ДанныеПоСчету(СчетУчета)
	
	Результат = Новый Структура;
	Результат.Вставить("ВидУчета"		, УправлениеОсновнымиСредствамиПовтИсп.ВидУчетаПоСчетуУчета(СчетУчета));
	Результат.Вставить("ВидИмущества"	, УправлениеОсновнымиСредствамиПовтИсп.ВидИмуществаПоСчетуУчета(СчетУчета));
	
	Возврат Результат;
	
КонецФункции

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
